{
    "general": {
        "title": "Desarrollador FullStack",
        "projectsTitle": "Proyectos destacados",
        "contactMe": "Contáctame",
        "followMe": "Sígueme",
        "viewOnGitHub": "Ver en GitHub"
    },
    "contact": {
        "email": "Correo electrónico",
        "phone": "Teléfono",
        "resume": "Hoja de vida",
        "downloadResume": "Descargar Hoja de vida"
    },
    "about": {
        "workTitle": "Mi trabajo",
        "aboutTitle": "Sobre mí",
        "hey": "¡Hola!",
        "i'm": "Soy",
        "aboutMe": "Sobre mí",
        "whoAmI": "¿Quién soy?",
        "paragraphWhoAmI": "Siempre he sido alguien curioso, con ganas de entender cómo funcionan las cosas. Desde que descubrí la programación, encontré en ella un espacio donde podía experimentar, construir y mejorar constantemente. Me gusta mantenerme en movimiento, aprendiendo y evolucionando, no solo como desarrollador, sino también en la forma en que afronto los problemas y colaboro con otros para llevar las ideas más allá del papel.",
        "whatILove": "Lo que me apasiona",
        "paragraphWhatILove": "Lo que más disfruto del desarrollo la capacidad de transformar una idea en algo funcional y útil. Me motiva enfrentar desafíos, analizar problemas y encontrar soluciones que realmente marquen la diferencia. Más allá del código, me interesa cómo cada decisión impacta la escalabilidad, el rendimiento y la experiencia del usuario. Me gusta experimentar con nuevas tecnologías y enfoques para mejorar la forma en que construyo software, siempre buscando aprender y perfeccionar mi trabajo."
    },
    "techStack": {
        "myTechStack": "Tecnologías favoritas",
        "backend": "Backend",
        "frontend": "Frontend",
        "dataBases": "Bases de datos",
        "apisAndMicroservices": "APIs y Microservicios"
    },
    "projects": {
        "myfinance": {
            "title": "MyFinance",
            "description": "MyFinance es una aplicación de gestión financiera personal que desarrollé para ayudar a los usuarios a rastrear gastos, establecer presupuestos y visualizar su salud financiera con gráficos interactivos. Este proyecto demuestra mi capacidad para crear soluciones prácticas y reales utilizando herramientas modernas y con un enfoque en la experiencia del usuario.",
            "features": {
                "title": "Caracteristicas principales",
                "welcomeInterface": {
                    "title": "Interfaz de Bienvenida",
                    "features": [
                        "Pantalla inicial con textos e imágenes que introducen la aplicación al usuario."
                    ]
                },
                "authenticationAndSecurity": {
                    "title": "Autenticación y Seguridad",
                    "features": [
                        "El sistema permite el registro de nuevos usuarios, inicio de sesión y recuperación de contraseñas mediante correo electrónico.",
                        "Para la autenticación, se utiliza un sistema de tokens (JWT). Al iniciar sesión con credenciales correctas, se genera un token con una duración de dos horas, el cual se invalida automáticamente al cerrar la sesión.",
                        "Las contraseñas no se almacenan en texto plano; en su lugar, se utilizan métodos de cifrado para garantizar su seguridad."
                    ]
                },
                "financialSummary": {
                    "title": "Resumen Financiero",
                    "features": [
                        "Panel interactivo con gráficos detallados.",
                        "Resumen del mes con ingresos, egresos, ahorros y dinero disponible.",
                        "Información del año organizada por mes, bimestre, trimestre o semestre.",
                        "Seguimiento de ahorros mes a mes.",
                        "Detalles de cada movimiento: Título, cantidad, etiqueta, meta asignada y otros detalles clave."
                    ]
                },
                "financialManagement": {
                    "title": "Gestión Financiera",
                    "features": [
                        "Registro, visualización, edición y eliminación de movimientos financieros.",
                        "Clasificación de movimientos como ingreso, egreso o ahorro.",
                        "Uso de etiquetas personalizadas para una mejor organización.",
                        "Enlace de movimientos a metas financieras.",
                        "Calendario interactivo para programar eventos financieros importantes.",
                        "Visualización de metas establecidas y eventos recurrentes (ingresos y gastos frecuentes).",
                        "Creación y seguimiento de objetivos financieros personales, como ahorro o control de gastos."
                    ]
                },
                "reports": {
                    "title": "Reportes",
                    "features": [
                        "Generación de documentos en PDF con los datos solicitados por el usuario para análisis o respaldo."
                    ]
                },
                "userProfile": {
                    "title": "Perfil de Usuario",
                    "features": [
                        "Gestión de datos personales con opciones para visualizar, editar y eliminar información."
                    ]
                },
                "customSettings": {
                    "title": "Configuración Personalizada",
                    "features": [
                        "Ajuste de colores en la interfaz para mejorar la experiencia del usuario.",
                        "Personalización de etiquetas para clasificar movimientos financieros."
                    ]
                }
            },
            "technologiesUsed": "Tecnologias utilizadas"
        }
    }
}